## Production: glue 🧴
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
etl.tf
```
```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   NAME                   |
|--------|------------------------------------------|
| add    | `aws_glue_job.forms_generate_test_data`  |
|        | `aws_s3_object.forms_generate_test_data` |
| update | `aws_iam_policy.glue_crawler`            |
|        | `aws_iam_policy.glue_etl`                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_glue_job.forms_generate_test_data will be created
  + resource "aws_glue_job" "forms_generate_test_data" {
      + arn                    = (known after apply)
      + default_arguments      = {
          + "--continuous-log-logGroup"          = "/aws-glue/jobs/encryption-at-rest/service-role/AWSGlueETL-DataLake/output"
          + "--continuous-log-logStreamPrefix"   = "forms_generate_test_data"
          + "--enable-continuous-cloudwatch-log" = "true"
          + "--enable-continuous-log-filter"     = "true"
          + "--enable-metrics"                   = "true"
          + "--enable-observability-metrics"     = "true"
          + "--num_partitions"                   = "1"
          + "--output_s3_path"                   = "s3://cds-data-lake-transformed-production/platform/gc-forms/forms/test/"
        }
      + glue_version           = (known after apply)
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + name                   = "Platform / GC Forms / Generate test data"
      + number_of_workers      = (known after apply)
      + role_arn               = "arn:aws:iam::739275439843:role/service-role/AWSGlueETL-DataLake"
      + security_configuration = "encryption-at-rest"
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + timeout                = (known after apply)
      + worker_type            = (known after apply)

      + command {
          + name            = "glueetl"
          + python_version  = "3"
          + runtime         = (known after apply)
          + script_location = "s3://cds-data-lake-glue-production/platform/gc-forms/generate_test_data.py"
        }

      + execution_property (known after apply)

      + notification_property (known after apply)
    }

  # aws_iam_policy.glue_crawler will be updated in-place
  ~ resource "aws_iam_policy" "glue_crawler" {
        id               = "arn:aws:iam::739275439843:policy/service-role/AWSGlueCrawler-DataLake"
        name             = "AWSGlueCrawler-DataLake"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:s3:::cds-data-lake-raw-production/*",
                          + "arn:aws:s3:::cds-data-lake-glue-production/*",
                            "arn:aws:s3:::cds-data-lake-curated-production/*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "kms:RetireGrant",
                            "kms:ReEncryptTo",
                            "kms:ReEncryptFrom",
                            "kms:GenerateDataKeyWithoutPlaintext",
                            "kms:GenerateDataKey",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                            "kms:CreateGrant",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:kms:ca-central-1:739275439843:key/991f91d8-209e-40f2-b925-915adf74a043"
                        Sid      = "UseGlueKey"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_iam_policy.glue_etl will be updated in-place
  ~ resource "aws_iam_policy" "glue_etl" {
        id               = "arn:aws:iam::739275439843:policy/service-role/AWSGlueETL-DataLake"
        name             = "AWSGlueETL-DataLake"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:s3:::cds-data-lake-raw-production/*",
                          + "arn:aws:s3:::cds-data-lake-glue-production/*",
                            "arn:aws:s3:::cds-data-lake-curated-production/*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:s3:::cds-data-lake-transformed-production/*",
                            "arn:aws:s3:::cds-data-lake-curated-production/*",
                        ]
                        Sid      = "WriteDataLakeS3TransformedBuckets"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # aws_s3_object.forms_generate_test_data will be created
  + resource "aws_s3_object" "forms_generate_test_data" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cds-data-lake-glue-production"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = "0b485eec6d843299cff1cb3816be9555"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "platform/gc-forms/generate_test_data.py"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./etl/platform/gc-forms/scripts/generate_test_data.py"
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.operations_aws_production_raw"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_catalog_database.platform_gc_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_account_tags"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.operations_aws_production_cost_usage_report"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.platform_gc_forms_forms_production"]
WARN - plan.json - main - Missing Common Tags: ["aws_glue_job.forms_generate_test_data"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_etl"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.aws_glue"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.forms_generate_test_data"]

32 tests, 19 passed, 13 warnings, 0 failures, 0 exceptions

```

</details>
